Repository: amirhy1377/DIAG
Catalog: DIAG/ui/flutter/lib/l10n/app_*.arb
Languages: ar, fa, ru, zh

# navDashboard
source: Dashboard
ar: لوحة التحكم
fa: داشبورد
ru: Панель управления
zh: 仪表盘

# navTelemetry
source: Telemetry
ar: القياسات
fa: تله‌متری
ru: Телеметрия
zh: 遥测

# navLogs
source: Logs
ar: السجلات
fa: گزارش‌ها
ru: Журналы
zh: 日志

# configHeading
source: Connection & Session
ar: الاتصال والجلسة
fa: اتصال و نشست
ru: Подключение и сеанс
zh: 连接与会话

# configBaseUrlLabel
source: Backend base URL
ar: عنوان الخادم الأساسي
fa: نشانی پایهٔ بک‌اند
ru: Базовый URL сервера
zh: 后端基础地址

# configBaseUrlApply
source: Save
ar: حفظ
fa: ذخیره
ru: Сохранить
zh: 保存

# configBaseUrlApplied
source: Backend URL updated
ar: تم تحديث عنوان الخادم
fa: نشانی بک‌اند به‌روزرسانی شد
ru: Адрес сервера обновлён
zh: 后端地址已更新

# configVinLabel
source: Vehicle VIN
ar: رقم الهيكل (VIN)
fa: VIN خودرو
ru: VIN автомобиля
zh: 车辆 VIN

# configPortLabel
source: Port
ar: المنفذ
fa: پورت
ru: Порт
zh: 端口

# configAdapterLabel
source: Adapter ID
ar: معرف المحوّل
fa: شناسه مبدل
ru: Идентификатор адаптера
zh: 适配器 ID

# configRateLabel
source: Target rate (Hz)
ar: المعدل المستهدف (هرتز)
fa: نرخ هدف (هرتز)
ru: Целевая частота (Гц)
zh: 目标频率 (Hz)

# configPidsLabel
source: Monitored PIDs
ar: معرّفات PID المراقبة
fa: PIDهای پایش‌شده
ru: Отслеживаемые PID
zh: 监控的 PID

# configPidsHint
source: Comma-separated, e.g. 010C,0105,0110
ar: افصل القيم بفاصلة، مثال: 010C,0105,0110
fa: با کاما جدا کنید، مثال: 010C,0105,0110
ru: Перечислите через запятую, например 010C,0105,0110
zh: 使用逗号分隔，例如 010C,0105,0110

# configLogRootLabel
source: Log directory
ar: مسار السجلات
fa: مسیر ذخیرهٔ گزارش
ru: Каталог журналов
zh: 日志目录

# configSeedLabel
source: Telemetry seed (optional)
ar: بذرة القياسات (اختياري)
fa: بذر تله‌متری (اختیاری)
ru: Seed телеметрии (необязательно)
zh: 遥测随机种子（可选）

# configStartButton
source: Start session
ar: بدء الجلسة
fa: شروع نشست
ru: Запустить сеанс
zh: 开始会话

# dashboardHeading
source: Diagnostic Control
ar: التحكم التشخيصي
fa: کنترل عیب‌یابی
ru: Управление диагностикой
zh: 诊断控制

# dashboardLoadingError
source: Failed to load session status
ar: فشل تحميل حالة الجلسة
fa: وضعیت نشست بارگیری نشد
ru: Не удалось загрузить состояние сеанса
zh: 无法加载会话状态

# dashboardNoSessionTitle
source: No session running
ar: لا توجد جلسة قيد التشغيل
fa: هیچ نشستی در حال اجرا نیست
ru: Сеанс не запущен
zh: 当前没有正在运行的会话

# dashboardNoSessionDescription
source: Adjust the session parameters above and press Start to begin streaming telemetry.
ar: اضبط معلمات الجلسة أعلاه واضغط بدء لبدء بث القياسات.
fa: پارامترهای نشست را در بالا تنظیم کرده و برای آغاز جریان تله‌متری دکمهٔ شروع را فشار دهید.
ru: Настройте параметры сеанса выше и нажмите "Запустить", чтобы начать поток телеметрии.
zh: 请先在上方配置会话参数，然后点击“开始”以开始传输遥测数据。

# dashboardSessionActive
source: Session active
ar: جلسة نشطة
fa: نشست فعال است
ru: Сеанс активен
zh: 会话已激活

# dashboardStartSuccess
source: Diagnostic session started
ar: تم بدء جلسة التشخيص
fa: نشست عیب‌یابی آغاز شد
ru: Диагностический сеанс запущен
zh: 诊断会话已启动

# dashboardStopSuccess
source: Diagnostic session stopped
ar: تم إيقاف جلسة التشخيص
fa: نشست عیب‌یابی متوقف شد
ru: Диагностический сеанс остановлен
zh: 诊断会话已停止

# dashboardRequestFailed
source: Request failed. Check the backend URL and try again.
ar: فشل الطلب. تحقق من عنوان الخادم ثم أعد المحاولة.
fa: درخواست انجام نشد. نشانی بک‌اند را بررسی کرده و دوباره تلاش کنید.
ru: Запрос не выполнен. Проверьте адрес сервера и повторите попытку.
zh: 请求失败，请检查后端地址后重试。

# dashboardInvalidRate
source: Enter a valid target rate.
ar: أدخل معدل هدف صالحاً.
fa: یک نرخ هدف معتبر وارد کنید.
ru: Введите корректную целевую частоту.
zh: 请输入有效的目标频率。

# dashboardInvalidPids
source: Provide at least one PID (comma separated).
ar: أدخل PID واحداً على الأقل (مفصولاً بفواصل).
fa: دست‌کم یک PID (با کاما جدا شده) وارد کنید.
ru: Укажите как минимум один PID (через запятую).
zh: 请至少输入一个 PID（使用逗号分隔）。

# infoSessionId
source: Session ID
ar: معرّف الجلسة
fa: شناسه نشست
ru: Идентификатор сеанса
zh: 会话 ID

# infoVin
source: VIN
zh: 车辆识别码

# infoAdapter
source: Adapter
ar: المحوّل
fa: مبدل
ru: Адаптер
zh: 适配器

# infoTargetRate
source: Target rate
ar: المعدل المستهدف
fa: نرخ هدف
ru: Целевая частота
zh: 目标频率

# infoActualRate
source: Actual rate
ar: المعدل الفعلي
fa: نرخ واقعی
ru: Фактическая частота
zh: 实际频率

# infoStarted
source: Started
ar: وقت البدء
fa: زمان آغاز
ru: Время запуска
zh: 开始时间

# infoMonitoredPids
source: Monitored PIDs
ar: PID المراقبة
fa: PIDهای پایش‌شده
ru: Отслеживаемые PID
zh: 监控的 PID

# dashboardStopSession
source: Stop session
ar: إيقاف الجلسة
fa: توقف نشست
ru: Остановить сеанс
zh: 停止会话

# dashboardRecentActivity
source: Recent Activity
ar: النشاط الأخير
fa: فعالیت‌های اخیر
ru: Последние действия
zh: 最近活动

# dashboardActivityCardTitle
source: Activity
ar: النشاط
fa: فعالیت
ru: Активность
zh: 活动

# dashboardActivityPlaceholder
source: Telemetry charts, DTC highlights, and session logs will appear here once a session is running.
ar: ستظهر مخططات القياسات وإشعارات DTC والسجلات هنا عند تشغيل الجلسة.
fa: با فعال شدن نشست، نمودارهای تله‌متری، رویدادهای DTC و گزارش‌ها در اینجا نمایش داده می‌شوند.
ru: Когда сеанс активен, здесь появятся графики телеметрии, уведомления DTC и журналы.
zh: 当会话运行时，这里会显示遥测图表、DTC 提示以及会话日志。

# dashboardActivityTelemetryTitle
source: Live telemetry streaming
ar: بث القياسات الحية
fa: جریان تله‌متری زنده
ru: Потоковая телеметрия
zh: 实时遥测流

# dashboardActivityTelemetrySubtitle
source: Navigate to the Telemetry tab to view charts.
ar: انتقل إلى علامة تبويب القياسات لعرض المخططات.
fa: برای دیدن نمودارها به برگهٔ تله‌متری بروید.
ru: Перейдите на вкладку "Телеметрия", чтобы посмотреть графики.
zh: 切换到“遥测”选项卡查看图表。

# dashboardActivityLogsTitle
source: Log pipeline active
ar: خط معالجة السجلات نشط
fa: خط لولهٔ گزارش فعال است
ru: Конвейер журналов активен
zh: 日志管道已启用

# dashboardActivityLogsSubtitle
source: Parquet writer is flushing data in the background.
ar: كاتب Parquet يقوم بالتفريغ في الخلفية.
fa: نویسندهٔ Parquet در پس‌زمینه در حال ذخیره‌سازی داده است.
ru: Процесс записи Parquet выполняет сброс в фоне.
zh: Parquet 写入器正在后台刷新数据。

# telemetryHeading
source: Live Telemetry
ar: القياسات الحية
fa: تله‌متری زنده
ru: Онлайн‑телеметрия
zh: 实时遥测

# telemetryDescription
source: Connect this client to the FastAPI websocket endpoint (/ws/telemetry) to stream these widgets.
ar: صِل هذا العميل بنقطة الويب سوكت FastAPI (/ws/telemetry) لبث هذه الودجات.
fa: این کلاینت را به نقطهٔ پایانی وب‌سوکت FastAPI (/ws/telemetry) متصل کنید تا این ویجت‌ها داده دریافت کنند.
ru: Подключите этот клиент к websocket FastAPI (/ws/telemetry), чтобы транслировать эти виджеты.
zh: 将此客户端连接到 FastAPI WebSocket 端点 (/ws/telemetry)，即可开始传输这些组件。

# telemetryCardHint
source: Data binding is live. Values below reflect the latest samples from the vehicle.
ar: الربط بالبيانات فعّال. القيم أدناه تعكس أحدث العينات من المركبة.
fa: اتصال داده فعال است. مقادیر زیر آخرین نمونه‌های دریافتی از خودرو هستند.
ru: Связь с данными активна. Значения ниже отражают последние образцы с автомобиля.
zh: 数据绑定已启用，下面的数值反映车辆最新的采样数据。

# telemetryAwaitingData
source: Waiting for telemetry...
ar: جارٍ انتظار بيانات القياسات...
fa: در انتظار دریافت تله‌متری...
ru: Ожидание телеметрии...
zh: 正在等待遥测数据...

# telemetryNoSession
source: Start a diagnostic session to stream telemetry.
ar: ابدأ جلسة تشخيص لبث القياسات.
fa: برای پخش تله‌متری یک نشست عیب‌یابی را آغاز کنید.
ru: Запустите диагностический сеанс, чтобы получить телеметрию.
zh: 请先启动诊断会话以接收遥测数据。

# telemetryStreamError
source: Telemetry stream error: {error}
ar: خطأ في تدفق القياسات: {error}
fa: خطای جریان تله‌متری: {error}
ru: Ошибка потока телеметрии: {error}
zh: 遥测流错误：{error}

# telemetryCardRpm
source: Engine RPM
ar: دورات المحرك
fa: دور موتور
ru: Обороты двигателя
zh: 发动机转速

# telemetryCardThrottle
source: Throttle Position
ar: موضع دواسة الوقود
fa: درصد گاز
ru: Положение дросселя
zh: 节气门位置

# telemetryCardCoolant
source: Coolant Temperature
ar: درجة حرارة سائل التبريد
fa: دمای مایع خنک‌کننده
ru: Температура охлаждающей жидкости
zh: 冷却液温度

# logsHeading
source: Session Logs
ar: سجلات الجلسة
fa: گزارش‌های نشست
ru: Журналы сеанса
zh: 会话日志

# logsDescription
source: Once the log API is exposed, the file list will populate below. Use this view to download, filter, and replay Parquet datasets.
ar: عند إتاحة واجهة السجلات ستظهر قائمة الملفات هنا. استخدم هذا العرض لتنزيل مجموعات Parquet وتصفيةها وإعادتها.
fa: پس از در دسترس بودن API گزارش، فهرست فایل‌ها در اینجا نمایش داده می‌شود. از این نما برای دانلود، فیلتر و اجرای مجدد داده‌های Parquet استفاده کنید.
ru: Как только API журналов станет доступен, список файлов появится ниже. Используйте это представление для загрузки, фильтрации и воспроизведения наборов Parquet.
zh: 当日志接口可用时，文件列表会显示在下方。使用该界面下载、筛选并回放 Parquet 数据集。

# logsEmptyTitle
source: No logs to display yet
ar: لا توجد سجلات للعرض بعد
fa: هنوز گزارشی برای نمایش نیست
ru: Журналы пока отсутствуют
zh: 暂无日志可显示

# logsEmptySubtitle
source: Implement the /v1/logs endpoint to fetch session history.
ar: نفّذ نقطة النهاية /v1/logs لاسترداد تاريخ الجلسات.
fa: برای دریافت تاریخچه نشست، نقطهٔ پایانی /v1/logs را پیاده‌سازی کنید.
ru: Реализуйте конечную точку /v1/logs для получения истории сеансов.
zh: 实现 /v1/logs 端点以获取会话历史。

# retryButton
source: Retry
ar: إعادة المحاولة
fa: تلاش دوباره
ru: Повторить
zh: 重试
